/**
 * @author Jangbi
 * Field 
 * Enum Data type Property
 * Example> 
 * 		Enum_data.LogType[3].N2  ->  코어삭제 return;
 * 		Enum_data.LogType[1].N3[2].S2  ->  게임상점내구매 return;
 */

var Enum_data = {
            'DataType':[
					            {'N1':0,'N2':'기타'},
					            {'N1':1,'N2':'아이템'},
					            {'N1':2,'N2':'헨치'},
					            {'N1':3,'N2':'골드'},
					            {'N1':4,'N2':'정보없음'}
              ],
	            'ItemType':[
						            {'N1':0,'N2':'시리얼재정비'},
						            {'N1':1,'N2':'루팅'},
						            {'N1':2,'N2':'게임상점내구매'},
						            {'N1':3,'N2':'현구매'},
						            {'N1':4,'N2':'운영툴'},
						            {'N1':5,'N2':'캐릭터생성시생성'},
						            {'N1':6,'N2':'퀘스트'},
						            {'N1':7,'N2':'겜블'},
						            {'N1':8,'N2':'성수호신 아이템'},
						            {'N1':9,'N2':'아이템물물교환'},
						            {'N1':10,'N2':'정보없음'},
						            {'N1':11,'N2':'특수상자오픈아이템'}
		            ],
		            'CoreType':[
						            {'N1':0,'N2':'시리얼재정비'},
						            {'N1':1,'N2':'루팅'},
						            {'N1':2,'N2':'게임상점내구매'},
						            {'N1':3,'N2':'현구매'},
						            {'N1':4,'N2':'운영툴'},
						            {'N1':5,'N2':'캐릭터생성시생성'},
						            {'N1':6,'N2':'퀘스트'},
						            {'N1':7,'N2':'믹스'},
						            {'N1':8,'N2':'성수호신생성'},
						            {'N1':9,'N2':'정보없음'}
		            ],
	                'OptionType':[
						            {'N1':0,'N2':'-'},
						            {'N1':1,'N2':'명중률'},
						            {'N1':2,'N2':'공격력'},
						            {'N1':3,'N2':'회피력'},
						            {'N1':4,'N2':'힘'},
						            {'N1':5,'N2':'민첩'},
						            {'N1':6,'N2':'정확'},
						            {'N1':7,'N2':'행운'},
						            {'N1':8,'N2':'HP'}
		            ],
		            'SynergyType':[
						            {'N1':0,'N2':'-'},
						            {'N1':1,'N2':'드래곤'},
						            {'N1':2,'N2':'악마'},
						            {'N1':3,'N2':'짐승'},
						            {'N1':4,'N2':'새'},
						            {'N1':5,'N2':'곤충'},
						            {'N1':6,'N2':'식물'},
						            {'N1':7,'N2':'미스터리'},
						            {'N1':8,'N2':'메탈'},
						            {'N1':9,'N2':'특수'}
		            ],
		            'RemarkType':[
					            {'N1':0,'N2':'정보없음'},
					            {'N1':1,'N2':'아이템옵션타입'},
					            {'N1':2,'N2':'아이템옵션레벨'},
					            {'N1':3,'N2':'헨치 옵션'},
					            {'N1':4,'N2':'시너지 타입'},
					            {'N1':5,'N2':'시너지 레벨'},
					            {'N1':6,'N2':'헨치 Max레벨'},
					            {'N1':7,'N2':'아이템 Duration'},
					            {'N1':8,'N2':'헨치 Sex변경'},
					            {'N1':9,'N2':'헨치 Att변경'},
					            {'N1':10,'N2':'캐릭터 Gold'},
					            {'N1':11,'N2':'헨치 레벨'},
					            {'N1':12,'N2':'아이템 카운트'},
					            {'N1':13,'N2':'캐릭터 타입'},
					            {'N1':14,'N2':'캐릭터 레벨'},
					            {'N1':15,'N2':'길드직책'},
					            {'N1':16,'N2':'길드 발기인'},
					            {'N1':17,'N2':'창고 개설단계'},
					            {'N1':18,'N2':'길드자금'},
					            {'N1':19,'N2':'물물교환'}
	                ],
	                'LogType':[
					            {	'N1':0,
					            	'N2':'아이템생성',
					            	'N3':[
					            	      	{'S1':0,'S2':'시리얼재정비'},
	                                       	{'S1':1,'S2':'루팅'},
	                                       	{'S1':2,'S2':'게임상점내구매'},
	                                       	{'S1':3,'S2':'현구매'},
	                                       	{'S1':4,'S2':'운영툴'},
	                                       	{'S1':5,'S2':'캐릭터생성시'},
	                                       	{'S1':6,'S2':'퀘스트'},
	                                       	{'S1':7,'S2':'겜블'},
	                                       	{'S1':8,'S2':'성수호신아이템'},
	                                       	{'S1':9,'S2':'물물교환'},
	                                       	{'S1':10,'S2':'정보없음'}
					                       ]
					            },
					            {	'N1':1,
					            	'N2':'코어생성',
					            	'N3':[
					            	      	{'S1':0,'S2':'시리얼재정비'},
	                                       	{'S1':1,'S2':'루팅'},
	                                       	{'S1':2,'S2':'게임상점내구매'},
	                                       	{'S1':3,'S2':'현구매'},
	                                       	{'S1':4,'S2':'운영툴'},
	                                       	{'S1':5,'S2':'캐릭터생성시'},
	                                       	{'S1':6,'S2':'퀘스트'},
	                                       	{'S1':7,'S2':'믹스'},
	                                       	{'S1':8,'S2':'성수호신생성'},
	                                       	{'S1':9,'S2':'정보없음'}
					                       ]
					            },
					            {	'N1':2,
					            	'N2':'아이템삭제',
					            	'N3':[
					            	      	{'S1':0,'S2':'사용'},
	                                       	{'S1':1,'S2':'내구도에의해깨짐'},
	                                       	{'S1':2,'S2':'구매상에팔기'},
	                                       	{'S1':3,'S2':'인첸트에의해사라짐'},
	                                       	{'S1':4,'S2':'덮어쓰기에의해사라짐'},
	                                       	{'S1':5,'S2':'필드에서일정시간마다지워짐'},
	                                       	{'S1':6,'S2':'퀘스트에의해사라짐'},
	                                       	{'S1':7,'S2':'운영툴에서삭제'},
	                                       	{'S1':8,'S2':'캐릭터삭제시'},
	                                       	{'S1':9,'S2':'정보없음'}
					                       ]
					            },
					            {	'N1':3,
					            	'N2':'코어삭제',
					            	'N3':[
					            	      	{'S1':0,'S2':'구매상에팔기'},
	                                       	{'S1':1,'S2':'인첸트에의해사라짐'},
	                                       	{'S1':2,'S2':'믹스실패로사라짐'},
	                                       	{'S1':3,'S2':'믹스성공으로사라짐'},
	                                       	{'S1':4,'S2':'필드에서일정시간마다지워짐'},
	                                       	{'S1':5,'S2':'퀘스트에의해사라짐'},
	                                       	{'S1':6,'S2':'운영툴에서삭제'},
	                                       	{'S1':7,'S2':'캐릭터삭제시'},
	                                       	{'S1':8,'S2':'성주변경으로삭제'},
	                                       	{'S1':9,'S2':'길마이양으로삭제'},
	                                       	{'S1':10,'S2':'길마이양,성주변경실패로주었던헨치삭제'},
	                                       	{'S1':11,'S2':'정보없음'}
					                       ]
					            },
					            {	'N1':4,
					            	'N2':'이동',
					            	'N3':[
					            	      	{'S1':0,'S2':'창고에넣기'},
	                                       	{'S1':1,'S2':'창고에서빼기'},
	                                       	{'S1':2,'S2':'필드에드랍'},
	                                       	{'S1':3,'S2':'필드에서줍기'},
	                                       	{'S1':4,'S2':'장착'},
	                                       	{'S1':5,'S2':'탈착'},
	                                       	{'S1':6,'S2':'EffectiveItem으로 이동'},
	                                       	{'S1':7,'S2':'정보없음'}
					                       ]
					            },
					            {	'N1':5,
					            	'N2':'교환',
					            	'N3':[
					            	      	{'S1':0,'S2':'노점상에팔기'},
	                                       	{'S1':1,'S2':'노점상에서 사기'},
	                                       	{'S1':2,'S2':'교환'},
	                                       	{'S1':3,'S2':'슈퍼노점상에팔기'},
	                                       	{'S1':4,'S2':'슈퍼노점상에서사기'}
					                       ]
					            },
					            {	'N1':6,
					            	'N2':'인첸트',
					            	'N3':[
					            	      	{'S1':0,'S2':'아이템옵션인첸트실패'},
	                                       	{'S1':1,'S2':'아이템옵션인첸트성공'},
	                                       	{'S1':2,'S2':'아이템레벨인첸트실패'},
	                                       	{'S1':3,'S2':'아이템레벨인첸트성공'},
	                                       	{'S1':4,'S2':'코어인첸트실패'},
	                                       	{'S1':5,'S2':'코어인첸트성공'},
	                                       	{'S1':6,'S2':'시너지타입실패'},
	                                       	{'S1':7,'S2':'시너지타입성공'},
	                                       	{'S1':8,'S2':'시너지레벨실패'},
	                                       	{'S1':9,'S2':'시너지레벨성공'},
	                                       	{'S1':10,'S2':'기능성아이템'}
					                       ]
					            },
					            {	'N1':7,
					            	'N2':'코어믹스',
					            	'N3':[
					            	      	{'S1':0,'S2':'코어믹스실패'},
	                              {'S1':1,'S2':'코어믹스성공'}
					               ]
					            },
					            {	'N1':8,
					            	'N2':'캐릭터삭제시삭제',
					            	'N3':[
					            	      	{'S1':0,'S2':'-'},
					                       ]
					            },
					            {	'N1':9,
					            	'N2':'캐릭터생성시생성',
					            	'N3':[
					            	      	{'S1':0,'S2':'-'},
					                   ]
					            },
					            {	'N1':10,
					            	'N2':'물물교환',
					            	'N3':[
					            	      	{'S1':0,'S2':'아이템물물교환'},
	                              {'S1':1,'S2':'겜블로아이템물물교환'}
					                       ]
					            },
					            {	'N1':11,
					            	'N2':'정보없음',
					            	'N3':[
					            	      	{'S1':0,'S2':'-'},
					                    ]
					            }
					            
	                ],
	                'M_LogType':[
					            {	'N1':0,
					            	'N2':'캐릭터생성',
					            	'N3':[
					            	      	{'S1':0,'S2':'시리얼재정비'},
                                {'S1':1,'S2':'게임에서생성'},
                                {'S1':2,'S2':'운영툴에서생성'},
                                {'S1':3,'S2':'정보없음'}
					                       ]
					            },
					            {	'N1':1,
					            	'N2':'캐릭터삭제',
					            	'N3':[
					            	      	{'S1':0,'S2':'삭제대기'},
                                {'S1':1,'S2':'완전삭제'},
                                {'S1':2,'S2':'운영툴에서삭제'},
                                {'S1':3,'S2':'정보없음'}
					                       ]
					            },
					            {	'N1':2,
					            	'N2':'길드',
					            	'N3':[
					            	      	{'S1':0,'S2':'길드생성마스터'},
                                {'S1':1,'S2':'길드생성발기인'},
                                {'S1':2,'S2':'깅드생성시 돈 뺏기'},
                                {'S1':3,'S2':'길드삭제'},
                                {'S1':4,'S2':'길마넘기기'},
                                {'S1':5,'S2':'길마받기'},
                                {'S1':6,'S2':'길드자금입금'},
                                {'S1':7,'S2':'길드자금출금'}
					                    ]
					            },
					            {	'N1':3,
					            	'N2':'창고',
					            	'N3':[
					            	      	{'S1':0,'S2':'창고 개설/확장'}
					                    ]
					            },
					            {	'N1':4,
					            	'N2':'공성전관련',
					            	'N3':[
					            	      	{'S1':0,'S2':'공격자신청'},
                                {'S1':1,'S2':'공격자 신청 취소'},
                                {'S1':2,'S2':'용병신청'},
                                {'S1':3,'S2':'용병취소'},
                                {'S1':4,'S2':'성주변경'},
					                   ]
					            },
					            {	'N1':5,
					            	'N2':'정보없음',
					            	'N3':[
					            	      	{'S1':0,'S2':'정보없음'}
					                    ]
					            }
					 ],
					 //Block_Type(code)
					 'BlockType':[
                        {'N1':'ALLOW','N2':'정상'},
						            {'N1':'GAME','N2':'게임'},
						            {'N1':'WEB','N2':'웹'},
						            {'N1':'SUM','N2':'웹/게임'},
						            {'N1':'WAIT','N2':'탈퇴대기'},
						            {'N1':'SECEDER','N2':'탈퇴'}
                  ],
            'BlockType2':[
						            {'N1':'GAME','N2':'게임'},
						            {'N1':'WEB','N2':'웹'},
						            {'N1':'SUM','N2':'웹/게임'},
						            {'N1':'WAIT','N2':'탈퇴대기'}
                  ],
           'ACC_Type':[
						            {'N1':'ALLOW','N2':'정상상태'},
						            {'N1':'DENY','N2':'블럭상태'},
						            {'N1':'WAIT','N2':'탈퇴대기'}
						           ],
             //Acc_Deny_Type(code)  
					 'ACC_DENYType':[
						            {'N1':'0','N2':'일반블럭'},
						            {'N1':'2200-12-31','N2':'영구압류'},
						            {'N1':'2222-12-31','N2':'캐릭삭제'}
                  ],
					 'CHAR_Type':[
						            {'N1':'0','N2':'디트','N3':[{'S1':8569},{'S1':307},{'S1':32192}]},
						            {'N1':'1','N2':'진','N3':[{'S1':10719},{'S1':30618},{'S1':4261}]},
						            {'N1':'2','N2':'펜릴','N3':[{'S1':5624},{'S1':32584},{'S1':32256}]},
						            {'N1':'3','N2':'포이','N3':[{'S1':605},{'S1':7685},{'S1':15227}]}
                  ],
					 'HType':[
						            {'N1':'0','N2':'-'},
						            {'N1':'1','N2':'힘쎈'},
						            {'N1':'2','N2':'날쎈'},
						            {'N1':'3','N2':'정확한'},
						            {'N1':'4','N2':'운좋은'},
						            {'N1':'5','N2':'속성강한'}
                  ],
            'HENCHType':[
						            {'N1':'0','N2':'드래곤'},
						            {'N1':'1','N2':'악마'},
						            {'N1':'2','N2':'짐승'},
						            {'N1':'3','N2':'새'},
						            {'N1':'4','N2':'곤충'},
						            {'N1':'5','N2':'식물'},
						            {'N1':'6','N2':'미스테리'},
						            {'N1':'7','N2':'메탈'}
                  ],
					  'PositionType':[
						            {'N1':'0','N2':'전투'},
						            {'N1':'1','N2':'포켓'},
						            {'N1':'2','N2':'창고'}
                  ],
					  'ItemSocketType':[
						            {'N1':'0','N2':'인벤토리'},
						            {'N1':'1','N2':'창고'},
						            {'N1':'2','N2':'장착'},
						            {'N1':'3','N2':'이펙티브아이템'}
                  ],
             //Item_Type_search(code)
					  'ItemType_GBN':[
						            {'N1':'0','N2':'NUI'},
						            {'N1':'1','N2':'장비'},
						            {'N1':'2','N2':'소모품'},
						            {'N1':'3','N2':'특수아이템'},
						            {'N1':'4','N2':'인첸트부가'},
						            {'N1':'5','N2':'인첸트강화'},
						            {'N1':'6','N2':'인첸트코어'},
						            {'N1':'7','N2':'헨치아이템'},
						            {'N1':'8','N2':'믹스아이템'},
						            {'N1':'9','N2':'메가폰'},
						            {'N1':'10','N2':'상자아이템'},
						            {'N1':'11','N2':'특수상자아이템'},
						            {'N1':'50','N2':'생산의 서(무기)'},
						            {'N1':'51','N2':'생산의 서(방어구)'},
						            {'N1':'52','N2':'생산의 서(액세서리)'},
						            {'N1':'53','N2':'생산의 서(소모성)'},
						            {'N1':'54','N2':'생산 주재료'},
						            {'N1':'55','N2':'생산 부재료'}
                  ],
                 'BlockSUBType':[
						            {'N1':'0','N2':'게시판 욕설/도배'},
						            {'N1':'1','N2':'게임 진행 방해'},
						            {'N1':'2','N2':'계정 양도/매매/교환 및 시도'},
						            {'N1':'3','N2':'교환 및 거래사기/시도'},
						            {'N1':'4','N2':'부모/성에 관한 욕설'},
						            {'N1':'5','N2':'부적절한 길드/캐릭 명'},
						            {'N1':'6','N2':'불법사이트 광고'},
						            {'N1':'7','N2':'불법프로그램 사용/유포'},
						            {'N1':'8','N2':'아이템몰 불법결제/시도'},
						            {'N1':'9','N2':'운영진/직원/회사사칭'},
						            {'N1':'10','N2':'일반 욕설/비방'},
						            {'N1':'11','N2':'유사캐릭터 사칭'},
						            {'N1':'12','N2':'유언비어 유포'},
						            {'N1':'13','N2':'일반 욕설/비방'},
						            {'N1':'14','N2':'캐릭및 사칭 사기'},
						            {'N1':'15','N2':'타 게임간 거래/시도'},
						            {'N1':'16','N2':'해킹'},
						            {'N1':'17','N2':'해킹프로그램 사용/유포'},
						            {'N1':'18','N2':'허위신고 및 제보'},
						            {'N1':'19','N2':'현금거래/시도'},
						            {'N1':'20','N2':'GM경고 무시/운영진행 방해'},
						            {'N1':'21','N2':'GM경고 무시/운영진행 방해'},
						            {'N1':'22','N2':'버그악용/유포'},
						            {'N1':'etc','N2':'기타'}
                  ],
                  'M_Question':[
						            {'N1':'','N2':'질문선택'},
						            {'N1':'00','N2':'아버지 성함은?'},
						            {'N1':'01','N2':'어머니 성함은?'},
						            {'N1':'02','N2':'제일 가보고 싶은곳은?'},
						            {'N1':'03','N2':'애완동물 이름은?'},
						            {'N1':'04','N2':'보물 제1호는?'},
						            {'N1':'05','N2':'내 좌우명은?'},
						            {'N1':'06','N2':'가장 존경하는 선생님 성함은?'},
						            {'N1':'07','N2':'자신의 별명은?'},
						            {'N1':'08','N2':'내 애인은?'}
                  ],
                  'JobType':[
						            {'N1':'','N2':'직업선택'},
						            {'N1':'00','N2':'회사원'},
						            {'N1':'01','N2':'전문직'},
						            {'N1':'02','N2':'초등학생'},
						            {'N1':'03','N2':'중고생'},
						            {'N1':'04','N2':'대학(원)생'},
						            {'N1':'05','N2':'공무원'},
						            {'N1':'06','N2':'자영업'},
						            {'N1':'07','N2':'주부'},
						            {'N1':'08','N2':'무직'},
						            {'N1':'09','N2':'기타'}
                  ],
                  'Server':[
						            {'N1':'','N2':'전체'},
						            {'N1':'마지리타','N2':'마지리타'},
						            {'N1':'메크리타','N2':'메크리타'},
						            {'N1':'헤르세바','N2':'헤르세바'},
						            {'N1':'프르마이','N2':'프르마이 '}
                  ],
                  'SEX':[
						            {'N1':'0','N2':'남자'},
						            {'N1':'1','N2':'여자'}
                  ],
                  'ITEM_GIVE_POSITION':[
						            {'N1':'I','N2':'인벤토리'},
						            {'N1':'S','N2':'창고'}
                  ],
                  'ITEM_DB_YN':[
						            {'N1':'0','N2':'가능'},
						            {'N1':'1','N2':'불가능'}
                  ],
                  'ITEM_Rarity':[
						            {'N1':'0','N2':'일반아이템'},
						            {'N1':'1','N2':'레어아이템'},
						            {'N1':'2','N2':'유니크아이템'}
                  ],
                  'Guild_Grade':[
						            {'N1':'1','N2':'신청대기중'},
						            {'N1':'2','N2':'가입거부자'},
						            {'N1':'3','N2':'발기인'},
						            {'N1':'4','N2':'탈퇴대기자'},
						            {'N1':'10','N2':'일반회원'},
						            {'N1':'11','N2':'부길마'},
						            {'N1':'12','N2':'길드마스터'},
						            {'N1':'13','N2':'길마대기'}
                  ],
                  'GilMa_ETC':[
						            {'N1':'0','N2':'양도받음'},
						            {'N1':'1','N2':'개설함'}
                  ]
                  
				};